# LinkElementId Constructor (ElementId) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkElementId Constructor (ElementId)
LinkElementId Class See Also
---
Creates a new LinkElementId representing an element in the host document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public LinkElementId(
	ElementId elementId
)
```

Visual Basic
---
```text
Public Sub New ( _
	elementId As ElementId _
)
```

Visual C++
---
```text
public:
LinkElementId(
	ElementId^ elementId
)
```

# ### Parameters
elementId
    Type: Autodesk.Revit.DB..::..ElementId The id of the element in the host document.
# See Also
LinkElementId Class
LinkElementId Overload
Autodesk.Revit.DB Namespace